# frozen_string_literal: true

cask_args appdir: '/Applications'

brew 'ack'
brew 'ansible'
brew 'asdf'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bat'
brew 'diff-so-fancy'
brew 'direnv'
brew 'dotdrop'
brew 'eza'
brew 'fzf'
brew 'ghostscript'
brew 'git'
brew 'gpg'
brew 'htop-osx'
brew 'imagemagick'
brew 'k9s'
brew 'kubectx'
brew 'lazydocker'
brew 'lazygit'
brew 'libpq'
brew 'nvim'
brew 'openssl'
brew 'pinentry-mac'
brew 'pkg-config'
brew 'readline'
brew 'ruby-build'
brew 'svn'
brew 'task'
brew 'taskwarrior-tui'
brew 'the_silver_searcher'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'v8'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'zoxide'

cask 'alacritty'
cask 'appcleaner'
cask 'arc'
cask 'arq'
cask 'bartender'
cask 'discord'
cask 'docker'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-sauce-code-pro-nerd-font'
cask 'grammarly-desktop'
cask 'istat-menus'
cask 'karabiner-elements'
cask 'licecap'
cask 'ngrok'
cask 'nordvpn'
cask 'notion'
cask 'postman'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'tomatobar'
cask 'tunein'
cask 'tunnelblick'
cask 'tuxera-ntfs'
cask 'visual-studio-code'
cask 'windsurf'
