# frozen_string_literal: true

cask_args appdir: '/Applications'

tap 'anomalyco/tap'

# --- Shell & Terminal ---
brew 'direnv'
brew 'htop'
brew 'tmux'
brew 'tmux-sessionizer'
brew 'zoxide' # smarter cd that ranks dirs by frequency

# --- Editors ---
brew 'neovim'
brew 'vim'

# --- Search & File Tools ---
brew 'ack'
brew 'bat'
brew 'eza'
brew 'fzf'
brew 'ripgrep'
brew 'the_silver_searcher' # ag command, fast code search
brew 'tlrc' # tldr pages client (simplified man pages)
brew 'tree'

# --- Git ---
brew 'diff-so-fancy'
brew 'gh'
brew 'git'
brew 'lazygit'
brew 'tig' # terminal UI for browsing git history

# --- Cloud & Kubernetes ---
brew 'awscli'
brew 'docker-credential-helper-ecr'
brew 'flyctl'
brew 'k9s'
brew 'kubectx'
brew 'lazydocker'

# --- Build & Libraries ---
brew 'autoconf'
brew 'automake'
brew 'cmake'
brew 'libpq'
brew 'luarocks'
brew 'openssl'
brew 'pkgconf'
brew 'readline'
brew 'svn'
brew 'v8'

# --- Security & Dotfiles ---
brew 'asdf'
brew 'dotdrop'
brew 'gnupg'
brew 'pinentry-mac'

# --- AI ---
brew 'kimi-cli'
brew 'anomalyco/tap/opencode'

# --- Task Management ---
brew 'task'
brew 'taskwarrior-tui'

# --- Media & Net ---
brew 'ghostscript'
brew 'imagemagick'
brew 'wget'
brew 'yarn'

# --- Fonts ---
cask 'font-caskaydia-cove-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-sauce-code-pro-nerd-font'

# --- Security & VPN ---
cask '1password'
cask '1password-cli'
cask 'nordvpn'
cask 'tunnelblick'

# --- Browsers ---
cask 'arc'
cask 'google-chrome'

# --- Development ---
cask 'bruno' # API client (Postman alternative)
cask 'dbeaver-community'
cask 'docker-desktop'
cask 'github'
cask 'ngrok'
cask 'visual-studio-code'
cask 'wezterm'

# --- Communication ---
cask 'discord'
cask 'hey-desktop'
cask 'slack'

# --- Productivity ---
cask 'bartender'
cask 'grammarly-desktop'
cask 'karabiner-elements'
cask 'raycast'
cask 'rectangle'

# --- AI ---
cask 'claude'

# --- Entertainment ---
cask 'spotify'
cask 'tunein'

# --- Utilities ---
cask 'appcleaner'
cask 'arq'
cask 'licecap'
cask 'the-unarchiver'
cask 'tuxera-ntfs'
cask 'typora'
